{"pages":[{"title":"About Me","text":"So in West Philadelphia born and raised, on the playground where I used to spend most time in a daze. Yeahhhh Now you know! Wooop Wooop!","tags":"pages","url":"about-me/"},{"title":"BRS Part One","text":"Blended Retirement System costs, financial analysis of the US Military's new retirement system effective 2018 This is a multi-stage analysis of the new retirement system for all military personel going into effect January 1, 2018. Part one is a programming project in Python adding a calculator to the Department of Defense's website at militarypay.defense.gov Under the previous system retirement was only awarded after 20 years of service, either active duty years or a combination including reserve 'good years'. A good year defined as meeting sufficient reserve service requirements. The new system will be a combination of pension, bonus and investment fund matching. Since only 17% of servicemembers stay to retire after 20 years, this new system will affect and potentially benefit the majority of servicemembers. The calculator takes in multiple pay tables saved as csv files, one of the simplest data storage formats. These tables therefore take up minimal space and can be read and wrote to by any system. The advantage of this calculator is it allows the user to retrieve reserve or active duty pay rates. User input determines which pay table is relevant and which particular pay on the chart to return. The program to do this is written in Python and the code is as follows with corresponding commenting. [gist:id=1d891e1cd9ed480be96b654ee9d7a841,filetype=python,GIST_PYGMENTS_STYLE='tango',GIST_PYGMENTS_LINENUM=True] The next project in this series will be data analysis to examine system wide costs and savings.","tags":"Projects","url":"brs-part-one.html"},{"title":"Why overspend for smoothies?","text":"Smoothies are liquid snacks that generally taste great, and an easy way to pack in what you should be having. Now if you search Costco for smoothie mix you'll find a bag of https://www.raderfarms.com/ fresh start smoothie mix in a 3 lbs (48 oz) bag sold for around $12. Inside are 6 pouches of 8oz each. Fresh Start smoothie blend While it's a very nice mix, I've switched over to just making my own. Still shopping at Costco but now I am combining two other products sold to make a similar mix. The new mixes Earthbound Farm Power Green That's 1.5 lbs (24 oz) of Spinach, Kale and chard and Kirkland Three Berry Blend Here we've got 4 lbs (64 oz) of Blackberries, Blueberries and Raspberries Product lb oz price $/oz Rader Farm smoothie mix 3 48 12 .25 Earthbound Farm Power Greens 1.5 24 4 .17 Kirkland Three Berry Blend 4 64 7 .11 Ok just to play some more with the numbers assuming the Rader Farm smoothie mix is 50/50 greens and berries by weight, then the simple combined $/oz price for my substitute mix is .14 which is compared to the .25 of the smoothie mix. So you're paying 78% more for the prepackaged baggies of smoothie mix. Notes: You lose out on strawberries but gain blackberries. Also the smoothie blend kale is mature and the Earthbound is baby kale. Go forth and make your own smoothie mix!","tags":"Diet&Fitness","url":"why-overspend-for-smoothies.html"},{"title":"Buying Guide for a budget gaming PC","text":"Goals: This is a gaming PC that can play most modern games on the maximum settings. This is also a self-build and every cost saving is used. This guide is a bit outdated since I built this a few years ago, the focus is to show how to price check and some buying recommendations as well as some installation advice. Also note this is written for a beginner level. Specifications: Part Name known as Brand Model Central Processing Unit CPU Intel i5-4690k Motherboard MOBO MSI Kraitos Graphics Processing Unit GPU AMD R9 290 4GB DCUII Solid State Drive SSD Crucial 240GB mx300 Harddrive HDD Western Digital 1TB Green internal Random Access Memory RAM 8gb 2 sticks of 4GB 1600mhz Case box NZXT S340 Accessory Brand/Model Monitor Asus VN 248 Keyboard TTesports Knucker Mouse Cobra E-3lue Headphones Logitech G230 Budget The first thing to check is your budget, a good way of getting an idea is look at some other builds and start getting an idea of the hardware you can afford in your budget. Some good sites to check are: Reddit's /r/buildapc and of course some prebuilt PC sites like Main Gear Don't be intimidated by some of the costs of $2,000+ PC builds, those tend to include dual graphics cards, custom cooling systems, the absolute best CPU and many bizarre addons like engravings, cutouts and LED lightups. No matter how aggressively styled your computer case is it won't make you click your mouse any faster. This guide assumes you're going for more of a barebones approach to a gaming PC and your home is room temperature. I also hope that the advice here is relevant to people building low end computers or one of those really high end monsters. Ok so now you have a better idea of your budget, I'm thinking under $1,000 is a good goal. As time goes on this should be more achievable. Hopefully. CPU The first thing to look at is your CPU, this determines your motherboard (MOBO). i5 or i7 processers use different socket architecture for instance, when buying a CPU look at socket (e.g. LGA1150 or LGA1151) to determine which mobo you can choose. I recommend Intel for power efficiency but not necessarily for cost and power. The trick here is to find a good deal. Keep in mind prebuilt computers won't include as many hardware deals that you can get shopping individually. This is where I start selling you on - Microcenter. Now I know locations vary and you might not even have one in your country. If Microcenter is an option be sure to include them as a key price checker. A good way to start that is stop by a store and pick up their product newspaper. There they'll list all the schemes of mixing and matching hardware to get instant discounts. Be careful when sniping off one piece at a time from Newegg or eBay as you'll miss out on deals like \"$100 off for buying a CPU and GPU together\". The meat of the matter is benchmarks. Intel and AMD create different CPU's so to learn the differences you'll have to check out benchmarks. This will be your own journey. An excellent website is cpubenchmark.net which allows you to compare CPUs as shown here. The CPU mark is a method of comparison. Keep in mind however you don't need the latest top of the line CPU, Moore's Law dictates you will increasingly be ripped off when it comes to building gaming PC's to run Hotline Miami. My i5-4690k manages to run games on max settings without having to full load and creating a necessity for cooling solutions. The stock cooler therefore works fine and that's a saving. Why doesn't my CPU get taxed by individual games? The GPU is the powerhouse that runs the games, which are chiefly graphically taxing. Don't expect too much from a lower end processer, but also don't expect your i7-7700 to need a $300 liquid cooling pump (with pulsating LEDs). Was it improper to discuss the GPU in the CPU section? Not at all. The GPU is the fundamental hardware for a gaming PC (budgetary concern), but the CPU is the fundamental hardware for a PC (technical concern). In other words your CPU determines other parts, but your GPU is independent and is also the most important part of your gaming rig. MOBO Now that you've picked your CPU you can look at corresponding motherboards. A CPU will list the socket it requires. The motherboard is the backbone for all the hardware you buy. I chose a MSI Kraitos due to the package deal offered with the CPU at Microcenter. The highlights are GPU This is the key decision point for your build, you can select from a wide range of cards and it'll be hard to tell what's right for you. The best way is to look at your budget and understand the GPU is really what pushes performance. In other words this will be your most expensive part. Don't feel weird if it costs more than your CPU. Especially if you're using a SLI/Crossfire setup to use dual graphics cards. Here's a benchmark website also ran by PassMark https://www.videocardbenchmark.net/ SSD The next step for a gaming pc is in my opinion getting a solid state drive to use as your boot drive. You'll get near instantaneous boot ups as well do your best to eliminate the cinematic loading screens. (Skyrim so fast you won't be able to read the loading screen tips.) The main concern is to research the brand reliability and then get a good price on a reasonable size. Look for at least 80gb, Rockstar's GTA:5 for instance takes up 70gb. Shoot for a 120 or 240. Write/read speed is not so important nowadays as they're all so fast. A SSD also has no moving parts, less noise and heat. The only two downsides are price and potential for shorter lifespan, both of which are improving to make them almost negligible points. HDD No need for a guide. Buy as many as you need and what you need. What your computer can support is determined by your mobo slots and power supply connections. You could even get by without one. You may consider data redundancy through a Raid setup here, this would allow you to dig through the bargain bin of refurbished HDD's. Keep in mind more HDD's means more power, noise and heat. Power supply So about that. Don't get suckered into buying a 1,000w power supply unless you need one. Each part so far will list its power demand. Add them up and add 200w to be safe. Signs of insufficient power can be random shutdowns and screen flickering. A 500w is often adequate. Make sure to add power demands of two graphics cards if you're doing a SLI/Crossfire setup. The main choice is modularity. This means at the cheap end the power supply will include all the wires, but they can't be removed. Semi-modular means the primary cords cannot be removed but the ones for each additional HDD or whatever you're powering can be added or left off as needed. Fully modular, you get just a power box and all the cords you might need. Since they're all the same technically why spend an extra $100 or more to get modularity? Because when it comes to fitting your build into a case a tangled mess of cords can pose more than just an aesthetic issue. Go with the cheapest option for this build. Make it work! While building the case you might really regret saving money here, keep in mind. Case The case will list supported motherboard sizes. Chances are if you're building a gaming PC you want a mid size case at least and a mobo that isn't a Mini or Micro. The larger case the less dense the computer parts are and better cooling. Go for something simple yet elegant, this is a budget build remember! Cases usually include a fan or two. Spring for one if it's not included. Keep in mind your parts so far should already include a stock cooler fan for your CPU and your graphics card very likely has it's own fan(s). You can also construct builds where the case is the first concern like for compact rigs, or those very interesting custom cases like a guitar or a fish tank! RAM Don't get sold on RAM, 24gb of RAM won't make your computer run any faster. Based on game monitoring, 8gb of RAM is a good amount, consider more if you do large image file processing. Store brand 1600mhz is fine, try as I could I didn't find much reason to spring for 2133mhz RAM sticks with enormous cooling fins. (Those enormous cooling fins might not fit in your case.) It's also something you can go cheap on now and easily swap later. My accessories I included my accessories for no particular reason other than they've all worked for me great and were reasonably priced. A mechanical keyboard offers a snappier feeling of response but they can be thunderously loud, expect them to be heard over phone calls. The mouse cost me about $8. To each their own. The G230 Headphones are highly recommended. Seemed broken due to how quiet they are but after some adjusting with my mobo's audio software they ended up working fine. Not too heavy or tight on the ears. They are a closed headset. The mic is very high quality, but picks up some background noise even after adjustments. Well deserving of its reputation. \"Putting it together\" And there it was, your core shopping list to build your case. I hope what I've written is timeless enough to be relevant to you and you have the confidence to pick the parts to put together your own case. If your pc will be primarily used over wifi, grab a wifi adapter that is ac (the newer wifi technology that features a strong pinpointed signal over 5ghz bands). To get mine to install, first I followed directions on how to physically install in the case, then I downloaded the drivers from the company website and put on a USB to transfer to my new computer in order to get internet and finish setup. Or just plug in via LAN and go from there. Part by part installation I won't go into here because a video is the best way of learning this and I'm not doing videos at this time. I recommend Linus Tech Tips on youtube, he has some detailed videos that will get you going. Some things to keep in mind Use a anti-static wristband when handling loose electronics. Hooking the clip to your metal case can work. Handle everything as carefully as you can, you don't want to get into the installation procedures wondering if a software issue is actually a damaged motherboard. Computer sites will often charge you extra on super duper cooling paste for your cpu (an actual term is Enhanced Thermal Interface Material), but your cpu comes with some already applied. As Linus mentions, less can be more so be careful if applying your own. Note I didn't include a CD drive so none of the included discs (gpu, wlan card) were used, I downloaded the latest drivers from the hardware manufacturer websites. Format your boot partition as UEFI, this is the newest standard and offers quicker startup as well as will allow you to dual boot later on. I also recommend a GPT partition and not a MBR formatted partition. The first thing to do upon initial setup is to install updates, this can take quite a while. I'll also be writing a guide on OS installations, Windows or Linux, and for all of these I'll assume you have no physical media besides your own USB. Prioritizing your GPU and getting a SSD will give you a high tech experience. If that isn't enough then you might want to prepare for more advanced techniques like overclocking and liquid cooling and dual graphics cards. Generally the only need for this comes from playing games that haven't been finetuned or rendering multiple screens and using multiple intensive applications, gaming and live streaming for instance. Computer manufacturing has come a long way, you aren't expected to solder and most compatibilities are well managed for you. Hold onto your receipts, Microcenter (yes that wonderful store again) gives you the option of receiving your receipt by email as well as on paper. You'll need to keep track of your purchases when it comes to returns and keep hold of the boxes the parts came in when it comes to rebates etc. Have fun and stay in budget.","tags":"Hardware","url":"buying-guide-for-a-budget-gaming-pc.html"},{"title":"My first blog, I'll use Pelican!","text":"I realized learning things and making projects doesn't mean much if I can't talk about and display my work. So after some research I learned I don't need to specialize in front end development or website design or javascript to build a presentable website. This is part of the progress of software becoming more user friendly and accessible. Higher level languages and static page generators! There are some great articles about static pages vs. dynamic ones out there and I'm a total amateur so I'll just link one here . Why use a static blog? I'm interested in something that is quick, efficient, small footprint so whatever I ultimately produce can be viewed quickly and not waste time bogged down in a database heavy website. I don't have anything against a dynamic site, and my next project will be to make a django based one on AWS. For now though a simple blog meant to present data science projects can perfectly be done on a static site. As of now the blog is not finished, and I'm not an expert on everything I've done so far. This article is more of a journal on some of the things I've done so far. Some great resources here. Check out Nafiul Islam's pelican setup guide . Start-up Download Python which should include pip which is a package manager. Using pip install Pelican. Use the quick set up, I chose to say Yes to uploading it to a Github page one day. Once I had a test site I started looking for a theme. It's fun to learn by picking things apart, a lot better than digging around in docs and failing a million ways. Themes Pelican has a repository of default themes you can choose. They recommend downloading the whole thing which I did but now seems rather unnecessary. I started by using foundation-default-colours. I poked around in the theme but then found features in another blog I wanted to work with. So off to kevin-deldycke-blog I went. It's not a default theme but it was one I wanted to work with. Customization It took a few days to start getting something clean but customized. I changed the backgrounds to some Japanese inspired patterns that look subtle and organized to me. Changed the Pygment to the solarized light instead of the solarized dark, dark code background was too jarring. Then I found tango is a nice default Pygment so I compiled it to a css and inserted it. The theme was coded to option allow a Disqus comment section but after some research and just plain preference I decided to use a static comment system . This is a rather weird setup which won't scale well, but it's very nice for what I want now. No account needed to comment, full markdown support for comments, all personal information and data handling is performed by me not an independent service. The downside is comments aren't immediately posted and the stock handling is I have to review and add the comment manually. I may make this automatic but handling comments manually is appealing right now.","tags":"Projects","url":"my-first-blog-ill-use-pelican.html"},{"title":"How to set up a openSUSE server","text":"So this is how to set up a server. Like this. And this. All done. Make sure to also do this. And do this.","tags":"Hardware","url":"how-to-set-up-a-opensuse-server.html"}]}